#+TITLE: My literate doom emacs config

** Essentials
Set fish as terminal by default, if not available use "$SHELL".
#+begin_src emacs-lisp :tangle yes
(setq fish-location (executable-find "fish"))
(setq vterm-shell (if (file-exists-p fish-location) fish-location (getenv "SHELL")))
(setq shell-file-name vterm-shell)
(setq explicit-shell-file-name "/bin/bash")

;; For fish to work
(add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
(ansi-color-for-comint-mode-on)
#+end_src

#+RESULTS:
: t
Remove LD_LIBRARY_PATH because it affects JAX
#+begin_src emacs-lisp :tangle yes
(setenv "LD_LIBRARY_PATH" nil)
#+end_src
Make ',' the local header key. Speeds up keybindings.
#+begin_src emacs-lisp :tangle yes
(setq doom-localleader-key ",")
#+end_src

#+RESULTS:
: ,

#+begin_src elisp :tangle yes
(setq ns-alternate-modifier 'meta)
(setq ns-right-alternate-modifier 'none)
#+end_src

** Quality of Life
auto-revert mode (Refreshing files after disk changes)
#+begin_src emacs-lisp :tangle yes
(global-auto-revert-mode t)
(repeat-mode t)
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp :tangle yes
(global-kkp-mode +1)
#+end_src


When select->paste delete selected text
#+begin_src emacs-lisp :tangle yes
(delete-selection-mode 1)
#+end_src

#+RESULTS:
: t

This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For relative line numbers, ret this to `relative'.
#+begin_src emacs-lisp :tangle yes
(setq display-line-numbers-type 'relative)
#+end_src

#+RESULTS:
: relative

Cursor configs
#+begin_src emacs-lisp :tangle yes
(blink-cursor-mode 1) ; Blink cursor
(beacon-mode 1) ; Highlight cursor when scrolling/changing windows
#+end_src

#+RESULTS:
: t

Open maximized
#+begin_src emacs-lisp :tangle yes
(add-to-list 'initial-frame-alist '(fullscreen . maximized))
#+end_src

#+RESULTS:
: ((fullscreen . maximized) (left-fringe . 8) (right-fringe . 8))

Remove hide keybinding
#+begin_src emacs-lisp :tangle yes
(global-unset-key (kbd "s-h"))
#+end_src

#+RESULTS:

*** Encoding :unused:
UTF encoding
#+begin_src emacs-lisp :tangle yes
;; Obtained from
;; https://github.com/tecosaur/emacs-config/blob/master/config.org
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (and (memq (plist-get (coding-system-plist buffer-file-coding-system) :category)
                                 '(coding-category-undecided coding-category-utf-8))
                           (not (memq (coding-system-eol-type buffer-file-coding-system) '(1 2))))
                t)))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)

(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
#+end_src

#+RESULTS:
: ► Doom

*** Venv
Python interpreter, completion and Inferior buferr settings
#+begin_src emacs-lisp :tangle yes
(after! python
(setq python-shell-interpreter "jupyter"
        python-shell-interpreter-args "console --simple-prompt"
        python-shell-prompt-detect-failure-warning nil)
(setq python-shell-completion-native-disabled-interpreters `(,@python-shell-completion-native-disabled-interpreters "jupyter"))
(add-hook 'python-mode-hook
          (lambda ()
            (setq-local python-shell-buffer-name
                        (format "Python %s"
                            (cadr (reverse (file-name-split (doom-modeline--project-root)))))))))

#+end_src

#+RESULTS:
| doom--setq-tab-width-for-python-mode-h | (lambda nil (setq-local python-shell-buffer-name (format Python %s (cadr (reverse (file-name-split (doom-modeline--project-root))))))) | er/add-python-mode-expansions | code-cells-mode-maybe | poetry-tracking-mode | +python-use-correct-flycheck-executables-h | evil-collection-python-set-evil-shift-width | doom-modeline-env-setup-python | (lambda nil (set (make-local-variable 'python-shell-buffer-name) (format Python %s (car (cdr (reverse (file-name-split (doom-modeline--project-root)))))))) | pipenv-mode | +lookup-init--set-python-mode |

Functions used for code-cells functionality
#+begin_src emacs-lisp :tangle yes
(after! python
  (add-hook! python-mode (add-hook 'python-mode-hook 'code-cells-mode-maybe))
  (add-hook! python-mode (add-hook 'before-save-hook 'lsp-organize-imports nil t))
  (add-hook! python-mode (add-hook 'before-save-hook 'lsp-format-buffer nil t))

 (defun previous-line-empty-p ()
   "Check if immediate previous line is empty.
  If region is active it checks from the region beginning.
  Useful to add extra \newlines to yasnippets."
   (if (region-active-p)
       (save-excursion (goto-char (region-beginning))
                       (line-before-pointer-empty-p))
     (line-before-pointer-empty-p)))


 (defun line-before-pointer-empty-p ()
   "Check if the line immediately before the pointer is empty."
   (save-excursion (forward-line -1)
                   (current-line-empty-p))))
#+end_src

* Reading
#+begin_src emacs-lisp :tangle yes
(setq doc-view-continuous t)
(setq doc-view-resolution 400)
#+end_src

#+RESULTS:
: 300

*** Style
Change font for elfeed-show buffer.
#+begin_src elisp :tangle yes
(setq elfeed-font (if (member "Mebinac" (font-family-list)) "Mebinac" "Century Schoolbook"))
(setq elfeed-show-mode-hook
      (lambda ()
          (set-face-attribute 'variable-pitch (selected-frame) :font (font-spec :family elfeed-font :size 16))
        ))
#+end_src

#+RESULTS:
| lambda | nil | (set-face-attribute 'variable-pitch (selected-frame) :font (font-spec :family elfeed-font :size 16)) |

*** elfeed-org
#+begin_src emacs-lisp :tangle yes

(setq rmh-elfeed-org-files (list (concat org-directory "personal/rss/elfeed.org")))

(after! elfeed
  (setq elfeed-search-filter "@2-weeks-ago +unread")
  (add-hook 'elfeed-search-mode-hook #'elfeed-update)


(defun find-in-elfeed-org-file ()
  "Find elfeed-show-entry in the first elfeed-org file"
      (interactive)
      (let* ((elfeed-show-entry-id (car (elfeed-entry-id elfeed-show-entry)))
            (elfeed-default-org-file (car rmh-elfeed-org-files))
            (elfeed-window (get-buffer-window (file-name-nondirectory elfeed-default-org-file))))

       (if (not elfeed-window) ; Open elfeed org file if not visible
         (progn
           (select-window (get-buffer-window "*elfeed-search*"))
           (let ((w (split-window-below)))
             (select-window w)
             (find-file elfeed-default-org-file)))
         (select-window elfeed-window))

       (or ;; Search pattern forward and backward
        (or (search-forward elfeed-show-entry-id nil t)
               (search-backward elfeed-show-entry-id nil t))
          (message
           (concat elfeed-show-entry-id " not found in elfeed-org file " elfeed-default-org-file)))))

(defun elfeed-eww-about ()
  "Open about page of elfeed entry in eww."
  (interactive)
  (eww-browse-url (concat "https://" (car (elfeed-entry-id elfeed-show-entry)) "/about")))

  (setq elfeed-goodies/entry-pane-size 0.6)
  (setq elfeed-goodies/log-window-size 0.4))

;; (after! elfeed
;;  (setq elfeed-score-serde-score-file (substitute-in-file-name "$HOME/.doom.d/elfeed.score")))
#+end_src

#+RESULTS:
: @2-weeks-ago +unread

Format headers buffer
#+begin_src emacs-lisp :tangle no
(defun concatenate-authors (authors-list)
  "Given AUTHORS-LIST, list of plists; return string of all authors
concatenated."
  (mapconcat
   (lambda (author) (plist-get author :name))
   authors-list ", "))
(defun my-search-print-fn (entry)
  "Print ENTRY to the buffer."
  (let* ((date (elfeed-search-format-date (elfeed-entry-date entry)))
         (title (or (elfeed-meta entry :title)
                    (elfeed-entry-title entry) ""))
         (title-faces (elfeed-search--faces (elfeed-entry-tags entry)))
         (feed (elfeed-entry-feed entry))
         (feed-title
          (when feed
            (or (elfeed-meta feed :title) (elfeed-feed-title feed))))
         (entry-authors (concatenate-authors
                         (elfeed-meta entry :authors)))
         (tags (mapcar #'symbol-name (elfeed-entry-tags entry)))
         (tags-str (mapconcat
                    (lambda (s) (propertize s 'face
                                            'elfeed-search-tag-face))
                    tags ","))
         (title-width (- (window-width) 10
                         elfeed-search-trailing-width))
         (title-column (elfeed-format-column
                        title (elfeed-clamp
                               elfeed-search-title-min-width
                               title-width
                               elfeed-search-title-max-width)
                        :left))
         (authors-width 135)
         (authors-column (elfeed-format-column
                          entry-authors (elfeed-clamp
                                         elfeed-search-title-min-width
                                         authors-width
                                         131)
                          :left)))

    (insert (propertize date 'face 'elfeed-search-date-face) " ")

    (insert (propertize title-column
                        'face title-faces 'kbd-help title) " ")

    (insert (propertize authors-column
                        'face 'elfeed-search-date-face
                        'kbd-help entry-authors) " ")

    ;; (when feed-title
    ;;   (insert (propertize entry-authors
    ;; 'face 'elfeed-search-feed-face) " "))

    (when entry-authors
      (insert (propertize feed-title
                          'face 'elfeed-search-feed-face) " "))

    (when tags
      (insert "(" tags-str ")"))))




(setq elfeed-search-print-entry-function #'my-search-print-fn)

#+end_src

#+RESULTS:
: my-search-print-fn
** Aesthetics
Org-modern
#+begin_src emacs-lisp :tangle yes

(after! org-modern
 (setq
  ;; Edit settings
  org-auto-align-tags nil
  org-tags-column 0
  org-catch-invisible-edits 'show-and-error
  org-special-ctrl-a/e t
  org-insert-heading-respect-content nil

  ;; Org styling, hide markup etc.
  org-hide-emphasis-markers t
  org-pretty-entities t
  org-ellipsis "…"

  ;; Agenda styling
  org-agenda-tags-column 0
  org-agenda-block-separator ?─
  org-agenda-time-grid
  '((daily today require-timed)
    (800 1000 1200 1400 1600 1800 2000)
    " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
  org-agenda-current-time-string
  "⭠ now ─────────────────────────────────────────────────"))

;; (add-hook 'org-mode-hook #'org-modern-mode)
;; (add-hook 'org-agenda-finalize-hook #'org-modern-agenda)

#+end_src

Main org directory
#+begin_src emacs-lisp :tangle yes
(setq org-directory "~/Documents/sync/org/")
#+end_src

#+RESULTS:
: ~/Documents/sync/org/

#+begin_src emacs-lisp :tangle yes

;; Other convenience shortcuts
;; Don't kill on paste
 (setq-default evil-kill-on-visual-paste nil)

;; Evil copy and comment
(map! :map evil-normal-state-map "g C" 'evilnc-copy-and-comment-lines)
(setq evil-move-beyond-eol t)

;; Give me back C-u
(setq evil-want-C-u-scroll nil
       evil-want-C-d-scroll nil
       evil-want-C-u-delete nil
 )


; kill current buffer faster
(map! "C-x k" 'kill-current-buffer)
(map! "C-x K" 'kill-buffer)
#+end_src

#+RESULTS:

*** Org-roam ui
Interface to visualise a personal database.
#+begin_src emacs-lisp :tangle no
(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

;; ;; org-roam-server configs
;; (use-package org-roam-server
;;   :ensure t
;;   :config
;;   (setq org-roam-server-host "127.0.0.1"
;;         org-roam-server-port 8080
;;         org-roam-server-authenticate nil
;;         org-roam-server-export-inline-images t
;;         org-roam-server-serve-files nil
;;         org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
;;         org-roam-server-network-poll t
;;         org-roam-server-network-arrows nil
;;         org-roam-server-network-label-truncate t
;;         org-roam-server-network-label-truncate-length 60
;;         org-roam-server-network-label-wrap-length 20))

;; (setq org-roam-db-update-method 'immediate)

#+end_src

#+RESULTS:
| r | reference | plain | %? | :if-new | (file+head references/%<%Y%m%d%H%M%S>-${slug}.org #+title: ${title} |

*** Markdown
Add it to enabled exports, since at some point it stopped being loaded by default
#+begin_src emacs-lisp :tangle yes
(after! org
   '(require 'ox-gfm nil t)
    (add-to-list 'org-export-backends 'md )
    (add-to-list 'org-export-backends 'gfm )
)
#+end_src

#+RESULTS:
| gfm | pandoc | beamer | md | ascii | html | icalendar | latex | odt |

*** References
#+begin_src emacs-lisp :tangle yes
(after! org
(customize-set-value 'org-latex-with-hyperref nil)
(add-to-list 'org-latex-default-packages-alist "\\PassOptionsToPackage{hyphens}{url}"))
#+end_src

#+RESULTS:
| \PassOptionsToPackage{hyphens}{url} | ( amsmath t (lualatex xetex)) | ( fontspec t (lualatex xetex)) | (AUTO inputenc t (pdflatex)) | (T1 fontenc t (pdflatex)) | ( graphicx t) | ( longtable nil) | ( wrapfig nil) | ( rotating nil) | (normalem ulem t) | ( amsmath t (pdflatex)) | ( amssymb t (pdflatex)) | ( capt-of nil) | ( hyperref nil) |

***  Bibliography
#+begin_src emacs-lisp :tangle yes
(after! org
 (setq org-log-done 'time)

 (use-package citar
   :no-require
   :custom
   (org-cite-global-bibliography '("~/Documents/sync/bibliography/bibliography.bib" "~/Documents/sync/bibliography/mac_bibliography.bib"))
   (org-cite-insert-processor 'citar)
   (org-cite-follow-processor 'citar)
   (org-cite-activate-processor 'citar)
   (citar-bibliography org-cite-global-bibliography)
   (org-cite-csl-styles-dir
    (expand-file-name "~/Zotero/styles/"))
     (map! "SPC n B" citar-open-files)))




#+end_src

#+RESULTS:


OX-extra for citations to work properly
It is also required for :ignore: flags to work properly
#+begin_src emacs-lisp :tangle yes
(use-package! ox-extra
  :after org
  :config
  (ox-extras-activate '(ignore-headlines))

  (use-package! citeproc-org
    :config
    (citeproc-org-setup)
    (require 'oc-csl))
  ;; ox-hugo configs
  (use-package! ox-hugo
    :after org)

  (use-package! citeproc-org
    :after ox-hugo
    :config
    (citeproc-org-setup))

;; TODO confirm this is necessary
  (setq org-cite-basic-author-column-end  100))

#+end_src

#+RESULTS:
: 100

** Text-based shenanigans

Function to toggle between paragraphs and bullet points whose first sentence is at a higher level.

#+begin_src emacs-lisp :tangle yes
  (defun next-nonblank-line ()
    (interactive)
    (forward-line)
    (skip-chars-forward "[:space:]"))


  (defun previous-nonblank-line ()
    (interactive)
    (forward-line -1)
    (when (current-line-empty-p)
      (beginning-of-line)
      (skip-chars-backward "[:space:]")))


  (defun lower-level-p ()
    (interactive)
    "Return true if there is a lower level"
    (save-excursion
      (org-end-of-line)
      (org-beginning-of-line)
      (let ((current-col (current-column))
            (next-line-col (save-excursion (next-nonblank-line) (org-end-of-line) (org-beginning-of-line) (current-column)))
            (lower-level-exists nil))
        (if (> next-line-col current-col)
            (progn (setq lower-level-exists 1) (message "Not a leaf node"))
          (message "Leaf node"))
        lower-level-exists)))

  (defun myorg-list-to-text ()
    (interactive)
    "Transform item list at point into section text.
      Searches for the next item list if there is none at point."
    (save-mark-and-excursion
      (if (lower-level-p) (next-nonblank-line))
      (unless (org-in-item-p)
        (org-list-search-forward (org-item-beginning-re)))
      (set-mark (org-end-of-item-list))
      (previous-nonblank-line)
      (org-beginning-of-item-list)
      (when (org-at-item-checkbox-p)
        (org-toggle-checkbox '(4)))
      (org-toggle-item nil)
      (previous-nonblank-line)
      (org-toggle-item nil)
      (unfill-paragraph)))


  (map! :map org-mode-map "M-Q" 'unfill-paragraph)

  (defun my-eval-string (string)
    (eval (car (read-from-string (format "(progn %s)" string)))))

  (defun eval-last-yanked ()
    "Evaluate last yanked expression"
    (interactive)
    (my-eval-string (current-kill 0)))


#+end_src

#+RESULTS:
: eval-last-yanked

Export
#+begin_src emacs-lisp :tangle no

;; Long Tables
(setq org-export-before-parsing-functions '(org-ref-glossary-before-parsing org-ref-acronyms-before-parsing))

#+end_src

#+RESULTS:
| org-ref-glossary-before-parsing | org-ref-acronyms-before-parsing |

*** Language Tool
To set this up on the computer install from [[https://github.com/languagetool-org/languagetool#scripted-installation-and-building][here]] and then set link this variable to the tool jar
#+begin_src emacs-lisp :tangle yes
;; For arch
(setq langtool-java-classpath nil)
;; Manually installed, for ubuntu
;; Cover both macos and ubuntu locations
(setq langtool-language-tool-jar (if (file-expand-wildcards "/home/alan/opt/LanguageTool-*/languagetool-commandline.jar") (file-expand-wildcards "/opt/LanguageTool-*/languagetool-commandline.jar")))

;; Show suggestions in pop-up window
(defun langtool-autoshow-detail-popup (overlays)
    (when (require 'popup nil t)
      ;; Do not interrupt current popup
      (unless (or popup-instances
                  ;; suppress popup after type `C-g` .
                  (memq last-command '(keyboard-quit)))
        (let ((msg (langtool-details-error-message overlays)))
          (popup-tip msg)))))

  (setq langtool-autoshow-message-function
        'langtool-autoshow-detail-popup)

  ;; Add local language and rules ignored
  (setq langtool-default-language "en-GB")
  (setq langtool-disabled-rules '(
                                  "OXFORD_SPELLING_Z_NOT_S"
                                  "WHITESPACE_RULE"
                                  "CURRENCY"))
#+end_src

#+RESULTS:
| OXFORD_SPELLING_Z_NOT_S | WHITESPACE_RULE | CURRENCY |

** Agenda
#+begin_src emacs-lisp :tangle yes
  (defun org-make-olist (arg)
    (interactive "P")
    (let ((n (or arg 1)))
      (when (region-active-p)
        (setq n (count-lines (region-beginning)
                             (region-end)))
        (goto-char (region-beginning)))
      (dotimes (i n)
        (beginning-of-line)
        (insert (concat (number-to-string (1+ i)) ". "))
        (forward-line))
      (beginning-of-line)))

  (setq org_notes "~/Documents/sync/org/roam/"
        zotero_bib "~/Documents/sync/PhD/bibliography/references.bib"
        org-time-stamp-formats
        '("<%Y-%m-%d %a>" . "<%Y-%m-%d %a %H:%M:%S>")
        ;; org-agenda-files '("~/Documents/sync/org/gtd/inbox.org"
        ;;                    "~/Documents/sync/org/gtd/gtd.org"
        ;;                    "~/Documents/sync/org/gtd/tickler.org")
        ;; org-refile-targets '(("~/Documents/sync/org/gtd/gtd.org" :maxlevel . 3)
        ;;                      ("~/Documents/sync/org/gtd/someday.org" :level . 1)
        ;;                      ("~/Documents/sync/org/gtd/tickler.org" :maxlevel . 2))
        )

(defun unpackaged/org-forward-to-entry-content (&optional unsafe)
  "Skip headline, planning line, and all drawers in current entry.
If UNSAFE is non-nil, assume point is on headline."
  (unless unsafe
    ;; To improve performance in loops (e.g. with `org-map-entries')
    (org-back-to-heading))
  (cl-loop for element = (org-element-at-point)
           for pos = (pcase element
                       (`(headline . ,_) (org-element-property :contents-begin element))
                       (`(,(or 'planning 'property-drawer 'drawer) . ,_) (org-element-property :end element)))
           while pos
           do (goto-char pos)))

(defun my-org-files-list ()
  (delq nil
    (mapcar (lambda (buffer)
      (buffer-file-name buffer))
      (org-buffer-list 'files t))))

#+end_src
#+begin_src emacs-lisp :tangle yes
(setq org-refile-targets '((my-org-files-list :maxlevel . 4)))
#+end_src

#+RESULTS:
: ((my-org-files-list :maxlevel . 4))

*** LaTeX
#+begin_src emacs-lisp :tangle no
  ;;Latex

  (defun org/parse-headings (backend)
    (if (member backend '(latex))
        (org-map-entries
         (lambda ()
           (progn
             (insert-string "#+LATEX: \\newpage")))

         "+newpage")))


  (add-hook 'org-export-before-parsing-hook 'org/parse-headings)
#+end_src
Make use of extarticle by default
#+begin_src emacs-lisp :tangle yes
(after! org
(setq org-latex-default-class "extarticle") )
#+end_src

#+RESULTS:
: extarticle

Captions and cdlatex
#+begin_src emacs-lisp :tangle yes
  (add-hook 'org-mode #'(cdlatex-mode))


  (setq org-latex-prefer-user-labels t
        org-latex-caption-above nil
        org-latex-listings 'minted
        )


;(after! org
  ;;Colours
;(add-to-list 'org-latex-packages-alist '("" "minted"))
;(add-to-list 'org-latex-packages-alist '("" "tabularx"))
;(plist-put org-format-latex-options :scale 1.75        )
;(add-to-list 'org-latex-packages-alist '("" "unicode-math")))
  ;; Temporarily increase margins
  ;; (add-to-list 'org-latex-packages-alist '("margin=2cm" "geometry"))
#+end_src

#+RESULTS:
: time

Set XeLaTex as our compiler
#+begin_src emacs-lisp :tangle yes
(setq org-latex-compiler "xelatex")
#+end_src
 Open new windows (such as exported PDF's in a new winddow)
#+begin_src emacs-lisp :tangle yes
  (setq org-link-frame-setup '(
                               ;; (vm . vm-visit-folder-other-frame)
                               ;; (vm-imap . vm-visit-imap-folder-other-frame)
                               ;; (gnus . org-gnus-no-new-news)
                               (file . find-file-other-window) ;;modified line
                               (wl . wl-other-frame)))

;; Custom latex->PDF conversion
  ;; (setq org-latex-pdf-process
  ;;       '("latexmk -pdflatex='pdflatex -interaction nonstopmode' -shell-escape -pdf -bibtex --synctex=1 -f %f"))
  ;; (setq org-latex-pdf-process
  ;;       '("latexmk -pdflatex='lualatex -interaction nonstopmode' -shell-escape -pdf -bibtex --synctex=1 -f %f"))
  (setq latex-run-command "xelatex")
  (setq org-latex-pdf-process
        '("latexmk -pdflatex='xelatex -interaction nonstopmode ' -shell-escape -pdf -f %f "
          ;; "makeglossaries %b"
          ;; "biber %b"
          ;; "makeindex %b"
          "latexmk -pdflatex='xelatex -interaction nonstopmode ' -shell-escape -pdf -f %f "
          "latexmk -pdflatex='xelatex -interaction nonstopmode ' -shell-escape -pdf -f %f "))



#+end_src

#+RESULTS:
| latexmk -pdflatex='xelatex -interaction nonstopmode ' -shell-escape -pdf -f %f |

*** Export
#+begin_src emacs-lisp :tangle no
(setq org-export-before-parsing-functions '(org-ref-glossary-before-parsing org-ref-acronyms-before-parsing))
#+end_src

#+RESULTS:
| org-ref-glossary-before-parsing | org-ref-acronyms-before-parsing |
** Org-poster
#+begin_src emacs-lisp :tangle yes
(after! org
 (add-to-list 'org-latex-classes
         '("beamerposter"
           "\\documentclass[final]{beamer}
           \\usepackage[T1]{fontenc}
           \\usepackage{lmodern}
           \\usepackage[size=custom,width=120,height=91,scale=1.0]{beamerposter}
           \\usepackage{graphicx}
           \\usepackage{booktabs}
           \\usepackage{tikz}
           \\usepackage{pgfplots}
           \\pgfplotsset{compat=1.14}
           \\usepackage{anyfontsize}
           [NO-DEFAULT-PACKAGES]"))
 (add-to-list 'org-latex-classes
         '("extarticle"
                 "\\documentclass{extarticle}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))

#+end_src

#+RESULTS:
| extarticle   | \documentclass{extarticle}    | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |                                            |
| extarticle   | \documentclass{extarticle}    | (\chapter{%s} . \chapter*{%s}) | (\section{%s} . \section*{%s})       | (\subsection{%s} . \subsection*{%s})       | (\subsubsection{%s} . \subsubsection*{%s}) |
| beamerposter | \documentclass[final]{beamer} |                                |                                      |                                            |                                            |

** Capture
#+begin_src emacs-lisp :tangle yes
;; (setq org-chef-folder (substitute-in-filename "$HOME/Documents/sync/org/personal/recipes/recipes/"))
(defun transform-square-brackets-to-round-ones(string-to-transform)
  "Transforms [ into ( and ] into ), other chars left unchanged."
  (concat
  (mapcar #'(lambda (c) (if (equal c ?\[) ?\( (if (equal c ?\]) ?\) c))) string-to-transform))
  )

(setq org-capture-templates
      '(
	("p" "Protocol" entry (file+headline "notes.org" "Inbox")
        "* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
	("L" "Protocol Link" entry (file+headline "notes.org" "Inbox")
        "* %? [[%:link][%(transform-square-brackets-to-round-ones \"%:description\")]]\n")
        ("c" "Cookbook" entry (file "personal/recipes/recipes/cookbook.org")
         "%(org-chef-get-recipe-from-url)"
         :empty-lines 1)
        ("m" "Manual Cookbook" entry (file "personal/recipes/cookbook.org")
         "* %^{Recipe title: }\n  :PROPERTIES:\n  :source-url:\n  :servings:\n  :prep-time:\n  :cook-time:\n  :ready-in:\n  :END:\n** Ingredients\n   %?\n** Directions\n\n")
))
#+end_src

#+RESULTS:
| c | Cookbook        | entry | (file ~/Documents/sync/org/personal/recipes/recipes/cookbook.org) | %(org-chef-get-recipe-from-url) | :empty-lines | 1 |
| m | Manual Cookbook | entry | (file ~/org/cookbook.org)                                         | * %^{Recipe title: }            |              |   |




Capture template
#+begin_src emacs-lisp :tangle yes
(defun capture-report-date-file (path)
  (let ((name (read-string "Name: ")))
    (expand-file-name (format "%s-%s.txt"
                              (format-time-string "%Y-%m-%d")
                              name) path)))

'(("t"
   "todo"
   entry
   (file (capture-report-date-file  "~/path/path/name"))
   "* TODO"))
#+end_src
** Customisations
Open pdfs inside emacs instead of other window
#+begin_src emacs-lisp :tangle yes
(add-to-list 'org-file-apps '("\\.pdf\\'" . emacs))
(add-to-list 'org-file-apps '("\\.eml\\'" . emacs))
#+end_src

#+RESULTS:
: ((\.pdf\' . emacs) (remote . emacs) (auto-mode . emacs) (directory . emacs) (\.mm\' . default) (\.x?html?\' . default) (\.pdf\' . default))

* Spell
#+begin_src emacs-lisp :tangle yes
(setq synosaurus-choose-method 'popup)
(setq org-M-RET-may-split-line t)
(setf org-blank-before-new-entry '((heading . auto) (plain-list-item . nil)))
#+end_src

#+RESULTS:
: ((heading . auto) (plain-list-item))
#+end_src

